import React from 'react';
import Layout from '../components/Layout/Layout';
import TitleComponent from '../components/ui/TitleComponent';
import SubtitleComponent from '../components/ui/SubtitleComponent';

const OfferContract = () => {
  return (
    <Layout>
      <section className="relative pb-[80px] pt-[100px] dark:bg-dark lg:pt-[120px]">
        <div className="container mx-auto">
          <div className="-mx-4 flex flex-col justify-center">
            <TitleComponent align="center" text="ДОГОВІР ПУБЛІЧНОЇ ОФЕРТИ" />
            <SubtitleComponent text="1. Загальні положення" />
            <p className='text-base text-dark-3 dark:text-dark-8'>1.1 Фізична особа-підприємець Разумей Галина Юріївна, надалі іменована «Виконавець», публікує дану публічну оферту про надання послуг.</p>
            <p>1.2 Відповідно до статей 633, 641 Цивільного Кодексу України даний документ, що розміщений в мережі Інтернет за адресою є публічною офертою, і в разі вчинення фізичною особою дій, які свідчать про її акцепт, є обов’язковою до виконання для Виконавця і цієї фізичної особи, в подальшому іменується «Замовник». Оплата Замовником послуг Виконавця є повним і безумовним акцептом оферти, та вважається укладенням Договору на умовах, що викладені в даній оферті.</p>
            <p>1.3 В даній оферті наведені нижче терміни вживаються в такому значенні:</p>
            <p>«Замовник» – особа, що сплатила вартість послуг, які надаються Виконавцем і є Стороною цього Договору.</p>
            <p>«Пропозиції» – публічна пропозиція Виконавця, адресована будь-якій фізичній або юридичній особі укласти з ним договір про надання послуг на існуючих умовах, що містяться в пропозиції.</p>
            <p>«Акцепт» – повне і безумовне прийняття Замовником умов оферти.</p>

            <SubtitleComponent text="2. Предмет Договору" />
            <p>2.1. Згідно з умовами цього Договору Виконавець надає послуги з організації та проведення навчання та консультування (відповідає КВЕД 70.22 Консультування з питань комерційної діяльності й керування) Замовника відповідно до Програми партнерського проєкту, а Замовник зобов’язується оплатити надані послуги відповідно до умов цього Договору.
            </p>
            <p>2.2. Перелік послуг, що надаються Виконавцем, вказаний на Інтернет-сайті Виконавця за адресою.</p>

            <SubtitleComponent text="3. Вартість послуг та порядок оплати" />
            <p>3.1. Оплата послуг за цим Договором здійснюється шляхом попередньої оплати Замовником вартості послуг.</p>
            <p>3.2. Вартість послуг визначається програмою проєкту, розміщеною на Інтернет-сайті Виконавця за адресою.</p>
            <p>3.3. Оплата може бути внесена у будь-який час перед початком процесу навчання та консультування.</p>
            <p>3.4. У разі дострокового розірвання Договору з ініціативи Замовника, кошти, які були ним сплачені в якості плати за надання послуг повертаються з урахуванням наступних умов:</p>
            <p>3.4.1 якщо Замовник відмовився від надання послуг не менше ніж за 24 години до початку доступу до курсу навчання – сплачені кошти повертаються Замовнику в повному обсязі в тижневий срок.</p>
            <p>3.5. Відмова від надання послуг повинна бути спрямована Замовником на електронну адресу Виконавця, яка зазначена у останньому розділі цього Договору. В цьому випадку Виконавець має право пересвідчитись в намірі Замовника розірвати Договір, зв’язавшись з ним за допомогою телефонного зв’язку або іншим способом.</p>
            <p>3.6. Розрахунки проводяться в безготівковій формі в національній валюті України.</p>
            <p>3.7 Оферта має силу акта про надання послуг і прийняття послуги здійснюється без підписання відповідного акта.</p>
            <p>3.8. Пропуск заходу у межах проєкту Замовником не є підставою для повернення йому коштів.</p>

            <SubtitleComponent text="4. Дія Договору" />
            <p>4.1. Договір набуває чинності з моменту акцепту оферти і діє до моменту припинення Договору.</p>
            <p>4.2. У разі розірвання Договору з ініціативи однієї із Сторін, порядок розрахунків регулюється даним Договором.</p>
            <p>4.3. Цей Договір може бути розірваний достроково з ініціативи однієї із Сторін на підставах, передбачених чинним законодавством України. Сторона, яка ініціює розірвання даного Договору, зобов’язана повідомити про це іншу Сторону (шляхом надсилання електронного листа) не менше ніж за 5 (п’ять) днів до передбачуваної дати розірвання Договору. Сторони погодили, у разі дострокового припинення дії цього Договору за ініціативи Замовника після старту проєкту, грошові кошти останньому не повертаються.</p>

            <SubtitleComponent text="5. Права і обов'язки Сторін" />
            <p>5.1. Виконавець зобов’язується:</p>
            <p>5.1.1. Надавати Замовнику послуги, відповідно до цього Договору та Програми, зазначеної на сайті Виконавця.</p>
            <p>5.2. Замовник зобов’язується:</p>
            <p>5.2.1. Оплатити в повному обсязі вартість послуг на умовах, встановлених цим Договором.</p>
            <p>5.2.2. Дотримуватись встановлених Виконавцем вимог, правил та інших умов надання послуг.</p>
            <p>5.2.3. Не використовувати та не поширювати жодним способом отримані матеріали даного проєкту з будь якою метою.</p>
            <p>5.3. Виконавець має право:</p>
            <p>5.3.1. Не надавати Замовнику послуги у разі, якщо Замовник не пред’явив Виконавцю підтвердження їх оплати (квитанцію про оплату, чек, інший розрахунковий документ).</p>
            <p>5.3.2. У разі необхідності, вносити зміни в порядок, час, строки надання послуг (зокрема, змінюючи розклад). Про зміни Виконавець завчасно повідомляє Замовника за допомогою розміщення відповідного оголошення загальнодоступним для огляду способом та (або) на Інтернет-сайті Виконавця або шляхом направлення відповідного електронного листа (email) / повідомлення, не пізніше ніж за 1 (один) календарний день до настання відповідних змін в розкладі.</p>
            <p>5.3.3. Отримувати від Замовника інформацію, необхідну для надання послуг за цим Договором.</p>
            <p>5.4. Замовник має право:</p>
            <p>5.4.1. Користуватися послугами Виконавця протягом терміну, передбаченого Програмою навчання і цим Договором.</p>
            <p>5.4.2. Отримувати необхідну і достовірну інформацію про графік роботи Виконавця і послуги.</p>

            <SubtitleComponent text="6. Порядок і умови надання послуг" />
            <p>6.1. Місце надання послуг є проведення онлайн-зустрічей за допомогою відповідних інформаційно-комунікаційних платформ.</p>
            <p>6.2. Перед початком заняття Замовник пред’являє Виконавцю документ, що підтверджує оплату послуг (квитанцію про оплату, чек або інший розрахунковий документ).</p>
            <p>6.3. Виконавець надає Замовнику обмежене, персональне і непередаване право на використання послуг і будь-яких матеріалів або інформації, отриманих в процесі навчання за курсом. Матеріали і будь-яку інформацію, що надаються в рамках наданої послуги, Замовник може використовувати тільки для особистого некомерційного використання.</p>

            <SubtitleComponent text="7. Відповідальність сторін" />
            <p>7.1. Замовник повністю приймає на себе відповідальність за стан свого здоров’я і погоджується з тим, що не має права вимагати від Виконавця будь-якої компенсації матеріального збитку і шкоди, заподіяної його здоров’ю.</p>
            <p>7.2. У разі заподіяння Замовником шкоди майну Виконавця, останній має право вимагати від Замовника повного відшкодування такої шкоди. Під шкодою Сторони розуміють порушення авторського права Виконавця, яке виражається у розповсюдженні відео/аудіо текстового чи будь-якого іншого матеріалу Виконавцю без згоди останнього.</p>
            <p>7.3. При настанні обставин непереборної сили, які виходять за межі розумного передбачення і контролю Сторін цього Договору, Сторони звільняються від відповідальності за невиконання зобов’язань, які повинні були бути виконані в період дії таких обставин.</p>
            <p>7.4. Сторони погоджуються, що Виконавець не гарантує будь-яких фінансових чи інших результатів від застосування Замовником в своїй діяльності послуг, придбаних у Замовника.</p>
            <p>7.5. У разі порушення Замовником умов цього Договору та використання матеріалів курсу не в особистих цілях, Виконавець має право розірвати цей Договір в односторонньому порядку, заблокувати Замовнику доступ до матеріалів проєкту, і в судовому порядку вимагати відшкодування збитків, завданих такими діями Замовника. В цьому випадку сплачені кошти Замовнику не повертаються.</p>

            <SubtitleComponent text="8. Конфіденційність Договору" />
            <p>8.1 Сторони домовились, що інформація та відомості, які стосуються цього Договору є конфіденційними і не можуть передаватися третім особам без попередньої письмової згоди іншої Сторони, крім випадків, коли така передача пов’язана з отриманням офіційних документів для виконання Договору або сплати податків, інших обов’язкових платежів, а також у випадках, передбачених законодавством.</p>
            <p>8.2 Сторони несуть відповідальність за законодавством України у разі розголошення конфіденційної інформації, яка стане їм відома при виконанні умов цього Договору.</p>
            <p>8.3 Жодна із Сторін не має права передавати свої права та обов’язки за Договором іншій особі без письмової згоди іншої Сторони.</p>
            <p>8.4 Сторони домовилися, фото і відео матеріали, які створені Виконавцем в процесі надання послуг, можуть використовуватися останнім для публікації в будь-яких джерелах інформації (в тому числі в соціальних мережах, на сайті Виконавця, тощо) з метою поширення рекламних відомостей про послуги, які їм надаються.</p>
            <p>8.5 Замовник підтверджує свою згоду на обробку Виконавцем його персональних даних, тобто на вчинення наступних дій щодо персональних даних Замовника: збір, систематизацію, внесення в бази даних Виконавця, в тому числі в електронні, накопичення, зберігання, уточнення, а також на подальше використання і поширення Виконавцем персональних даних відповідно до положень Закону України «Про захист персональних даних».</p>
            <p>8.6 Сторони домовились, що Виконавець буде здійснювати збір і накопичення персональних даних Замовника на паперових та/або електронних носіях, в тому числі шляхом внесення їх в базу даних Виконавця.</p>
            <p>8.7. Питання, не врегульовані цим Договором, регулюються інформацією, вказаною на Інтернет-сайті Виконавця за адресою і чинним законодавством України.</p>
            <p>8.8. Даний Договір розміщений на сайті Виконавця та викладений українською мовою.</p>

            <SubtitleComponent text="9. Вирішення спорів" />
            <p>9.1 У разі виникнення суперечок або розбіжностей Сторони зобов’язуються вирішувати їх шляхом переговорів.</p>
            <p>9.2 У разі недосягнення Сторонами згоди, спори вирішуються в судовому порядку.</p>

            <SubtitleComponent text="10. Реквізити Виконавця:" />
            <p>
              Фізична особа-підприємець Разумей Галина Юріївна<br />
              ІПН: 3177009263<br />
              Запис про проведення державної реєстрації фізичної особи-підприємця<br />
              від 30.10.2022 № 2010350000000223127<br />
              п/р: UA943220010000026003330033426 в Акціонерне Товариство УНІВЕРСАЛ БАНК <br />
              Адреса: Україна, 49044, Дніпропетровська обл., місто Дніпро, вул. Вернадського Володимира,
              будинок 8а, кімната 112 <br />
              h.razumei@gmail.com <br />
              тел. 0668247657

            </p>
          </div>
        </div>
      </section>
    </Layout>
  )
}

export default OfferContract;