import React from 'react';

import Layout from "../components/Layout/Layout";
import TitleComponent from '../components/ui/TitleComponent';
import SubtitleComponent from '../components/ui/SubtitleComponent';


const PrivacyPolicy = () => {
  return (
    <Layout>
      <section className="relative pb-[80px] pt-[100px] dark:bg-dark lg:pt-[120px]">
        <div className="container mx-auto">
          <div className="-mx-4 flex flex-col items-center justify-center">
            <TitleComponent text="ПОЛІТИКА КОНФІДЕНЦІЙНОСТІ" />
            <p className='text-base text-dark-3 dark:text-dark-8'>Партнери проєкту <strong>«Кар’єрне консультування з коучинговою підтримкою»</strong> Галина Разумей, ICF та волонтерський проєкт Women in Engineering (далі - "Ми", "Партнери") прагнуть забезпечити конфіденційність та захист особистих даних наших користувачів. Наша політика конфіденційності описує, як ми збираємо, використовуємо, розкриваємо, передаємо та зберігаємо інформацію, яку надають наші користувачі нашому веб-сайту та відповідних послугах.</p>

            <SubtitleComponent align="center" text="Збір та використання інформації" />
            <p className='text-base text-dark-3 dark:text-dark-8'>Ми можемо збирати різні види інформації для різних цілей з метою надання та покращення наших послуг. Ваші особисті дані можуть включати, але не обмежуватися, наступними:

              <ul className='list-inside list-disc'>
                <li><strong>Особиста інформація:</strong> В рамках користування нашими послугами, ви можете надавати особисті дані, такі як ім'я, електронну пошту та контактну інформацію.</li>
                <li><strong>Інформація про використання:</strong>  Ми автоматично збираємо інформацію про те, як ви використовуєте наш веб-сайт та послуги, включаючи дані про ваші запити, діяльність на сайті та іншу інформацію.</li>
                <li><strong>Інформація з файлів журналів:</strong> Ми можемо збирати інформацію з файлів журналів сервера, таку як IP-адреси, запити браузера, дата та час ваших відвідувань.</li>
              </ul>
            </p>

            <SubtitleComponent align="center" text="Використання інформації" />
            <p className='text-base text-dark-3 dark:text-dark-8'>Ми використовуємо інформацію, яку ми збираємо, для наступних цілей:

              <ul className='list-inside list-disc'>
                <li><strong>З вашого дозволу:</strong> Ми можемо розкривати вашу інформацію за вашою згодою.</li>
                <li><strong>З метою виконання обов'язків:</strong> Ми можемо розкривати інформацію для виконання наших обов'язків та надання послуг.</li>
                <li><strong>З метою захисту прав та безпеки:</strong> Ми можемо розкривати інформацію для захисту прав, власності або безпеки партнерів, користувачів та інших осіб.</li>
                <li><strong>Законодавство та дотримання правил:</strong> Ми можемо розкривати інформацію відповідно до законодавства та вимог регуляторів.</li>
              </ul>
            </p>

            <SubtitleComponent align="center" text="Зберігання інформації" />
            <p className='text-base text-dark-3 dark:text-dark-8'>Ми зберігаємо інформацію лише стільки часу, скільки вона необхідна для досягнення цілей, зазначених у цій політиці конфіденційності, якщо інше не вимагає законодавство.</p>

            <SubtitleComponent align="center" text="Зміни в політиці конфіденційності" />
            <p className='text-base text-dark-3 dark:text-dark-8'>Ми можемо час від часу оновлювати цю Політику конфіденційності. Будь ласка, періодично переглядайте цю сторінку, щоб бути в курсі будь-яких змін. Продовжуючи використовувати наш веб-сайт після внесення змін до цієї Політики конфіденційності, ви підтверджуєте свою згоду з такими змінами.</p>

            <SubtitleComponent align="center" text="Зв'яжіться з нами" />
            <p className='text-base text-dark-3 dark:text-dark-8'>Якщо у вас є будь-які питання щодо цієї політики конфіденційності або її застосування, будь ласка, зв'яжіться з нами за адресою <a href="mailto:h.razumei@gmail.com">h.razumei@gmail.com</a>. Ця Політика конфіденційності набуває чинності з дати її публікації.</p>
          </div>
        </div>
      </section>

    </Layout>
  )
}

export default PrivacyPolicy;
